In [ ]:
import yfinance as yf
import pandas as pd

all_data = {ticker:yf.download(ticker) for ticker in ['2330.TW','2303.TW','2454.TW','2317.TW']}
all_data

In [ ]:
new_data = {key:df[('Adj Close', key)] for key,df in all_data.items()}
df = pd.DataFrame(new_data)
df1 = df.rename(columns={
    '2330.TW':'台積電',
    '2303.TW':'聯電',
    '2454.TW':'聯發科',
    '2317.TW':'鴻海'
})
df1

In [3]:
df2 = df1.dropna()

In [4]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5815 entries, 2001-07-23 to 2024-12-19
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   台積電     5815 non-null   float64
 1   聯電      5815 non-null   float64
 2   聯發科     5815 non-null   float64
 3   鴻海      5815 non-null   float64
dtypes: float64(4)
memory usage: 227.1 KB

In [5]:
df2

                    台積電         聯電          聯發科          鴻海
Date
2001-07-23    19.903191  11.343292    27.977869   15.367785
2001-07-24    19.731501  11.311161    29.767588   15.063484
2001-07-25    20.246233  11.600368    31.842102   15.469896
2001-07-26    20.760963  11.921703    34.007641   15.976395
2001-07-27    21.790432  12.178777    33.912838   15.672087
...                 ...        ...          ...         ...
2024-12-13  1065.000000  41.450001  1410.000000  186.500000
2024-12-16  1085.000000  41.450001  1385.000000  182.000000
2024-12-17  1075.000000  42.549999  1425.000000  183.000000
2024-12-18  1085.000000  43.700001  1420.000000  184.500000
2024-12-19  1070.000000  43.000000  1420.000000  181.000000

[5815 rows x 4 columns]

In [6]:
df3 = df2.pct_change().dropna()

In [7]:
df3.corr()

          台積電        聯電       聯發科        鴻海
台積電  1.000000  0.599523  0.434737  0.487236
聯電   0.599523  1.000000  0.377358  0.424866
聯發科  0.434737  0.377358  1.000000  0.372232
鴻海   0.487236  0.424866  0.372232  1.000000

In [8]:
(df2 - df2.shift(1)).dropna()

                  台積電        聯電        聯發科        鴻海
Date
2001-07-24  -0.171690 -0.032131   1.789719 -0.304300
2001-07-25   0.514732  0.289207   2.074514  0.406412
2001-07-26   0.514730  0.321335   2.165539  0.506498
2001-07-27   1.029469  0.257073  -0.094803 -0.304308
2001-07-30   0.000000  0.000000   0.000000  0.000000
...               ...       ...        ...       ...
2024-12-13   5.000000 -1.049999  30.000000 -2.000000
2024-12-16  20.000000  0.000000 -25.000000 -4.500000
2024-12-17 -10.000000  1.099998  40.000000  1.000000
2024-12-18  10.000000  1.150002  -5.000000  1.500000
2024-12-19 -15.000000 -0.700001   0.000000 -3.500000

[5814 rows x 4 columns]